Revit 2027 API
BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure Property
 The parameter runwidth is great or the parameter min width at inside boundary is too great, or number of parallel treads at both ends is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure { get; }
Public Shared ReadOnly Property WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure {
	FailureDefinitionId^ get ();
}
static member WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace